000010*================================================================
000020* SAMPLE01 - COBOLロジック階層可視化ツール 標準形式サンプル
000030*================================================================
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. SAMPLE01.
999999* ##### !! ツール挿入行 (確認要) !! #####
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000080 01 WK-AGE         PIC 9(03).
000090 01 WK-KBN         PIC X(01).
000100 01 WK-FLG         PIC X(01).
000110 01 IN-CD          PIC X(02).
000120 01 WK-TBL.
000130    05 WK-ENT OCCURS 5 INDEXED BY WK-I.
000140       10 WK-ENT-CD   PIC X(02).
000150       10 WK-ENT-NM   PIC X(10).
000160 PROCEDURE DIVISION.
000170 MAIN-RTN SECTION.
000180 MAIN-START.
000190     PERFORM INIT-RTN.
000200     PERFORM CHECK-RTN.
000210     PERFORM SEARCH-RTN.
000220     PERFORM EDIT-RTN THRU EDIT-EXIT.
000230     CALL 'SUBPGM01' USING WK-KBN.
000240     STOP RUN.
999999* ##### !! ツール挿入行 (確認要) !! #####
000250 INIT-RTN.
000260     MOVE ZERO TO WK-AGE.
000270     MOVE SPACE TO WK-FLG.
000280 CHECK-RTN.
000290     IF WK-AGE = 0
000300         IF WK-KBN = '1'
000310             MOVE 'A' TO WK-FLG
000320             PERFORM UPDATE-RTN
000330         ELSE
000340             MOVE 'B' TO WK-FLG
000350         END-IF
000360     ELSE
000370         PERFORM SKIP-RTN
000380     END-IF.
000390     EVALUATE WK-KBN
000400         WHEN '1'
000410             PERFORM PROC-A
000420         WHEN '2'
000430             PERFORM PROC-B
000440         WHEN OTHER
000450             PERFORM PROC-OTHER
000460     END-EVALUATE.
000470 SEARCH-RTN.
000480     SET WK-I TO 1.
000490     SEARCH WK-ENT
000500         AT END
000510             MOVE 'N' TO WK-FLG
000520         WHEN WK-ENT-CD (WK-I) = IN-CD
000530             MOVE 'Y' TO WK-FLG
000540     END-SEARCH.
000550 UPDATE-RTN.
000560     MOVE '9' TO WK-KBN.
000570 SKIP-RTN.
000580     CONTINUE.
000590 PROC-A.
000600     MOVE 'A' TO WK-KBN.
000610 PROC-B.
000620     MOVE 'B' TO WK-KBN.
000630 PROC-OTHER.
000640     MOVE 'X' TO WK-KBN.
000650 EDIT-RTN.
000660     MOVE SPACE TO WK-FLG.
000670 EDIT-EXIT.
000680     EXIT.
